app/Controllers/Computer.php

INSERT INTO `assets` (`asset_number`, `id_asset`, `jenis`, `nama_produk`, `serial_number`, `user`) VALUES ('C00237', 'GPI0002', 'Laptop', 'Dell Latitude 3420', '999VMG3', 'JAMALUDDIN')
---
                    'serial_number' => strtoupper($this->request->getVar('serial_number')),
                    'user' => strtoupper($this->request->getVar('user')),
                ];
                $this->assetsModel->save($data);