app/Controllers/Computer.php

    public function index()
    {
        $data = [
            'computers' => $this->assetsModel->like('jenis', 'Laptop')->orLike('jenis', 'PC')->findAll(),
            'title' => 'Computer',
        ];
---
SELECT *
FROM `assets`
WHERE `jenis` LIKE '%Laptop%' ESCAPE '!'
OR  `jenis` LIKE '%PC%' ESCAPE '!'

    public function detail($id)
    {
        $data = [
            'computer' => $this->assetsModel->find($id),
            'title' => 'Detail Computer',
        ];
---
SELECT *
FROM `assets`
WHERE `assets`.`id` = '11'

    public function delete($id)
    {
        $this->assetsModel->delete($id);
---
DELETE FROM `assets`
WHERE `id` IN ('9')