app/Controllers/Computer.php

    public function index()
    {
        $data = [
            'computers' => $this->computerModel->findAll(),
            'title' => 'Computer',
        ];
---
SELECT *
FROM `computer`

                    'serial_number' => strtoupper($this->request->getVar('serial_number')),
                    'user' => strtoupper($this->request->getVar('user')),
                ];
                $computerModel->save($data);
---
INSERT INTO `computer` (`asset_number`, `id_computer`, `jenis`, `nama_produk`, `serial_number`, `user`) VALUES ('C00238', 'GPI003', 'Laptop', 'Dell Latitude 3420', '999VMG3', 'JAMALUDDIN')

    public function detail($id)
    {
        $data = [
            'computer' => $this->computerModel->find($id),
            'title' => 'Detail Computer',
        ];
---
SELECT *
FROM `computer`
WHERE `computer`.`id` = '44'

    public function edit($id)
    {
        $data = [
            'computer' => $this->computerModel->find($id),
            'title' => 'Detail Computer',
            'validation' => \Config\Services::validation()
        ];
---
SELECT *
FROM `computer`
WHERE `computer`.`id` = '31'