app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `assets`
WHERE `jenis` = 'Network'
SELECT COUNT(*) AS `numrows`
FROM `assets`
WHERE `jenis` = 'PC'
---
    public function index()
    {
        $data = [
            'laptop' => $this->assetsModel->where('jenis', 'Laptop')->countAllResults(),
            'pc' => $this->assetsModel->where('jenis', 'PC')->countAllResults(),
            'title' => 'Home'
        ];