app/Controllers/Network.php

SELECT *
FROM `assets`
WHERE `jenis` LIKE '%Network%' ESCAPE '!'
---
    public function index()
    {
        $data = [
            'title' => 'Network',
            'networks' => $this->assetsModel->like('jenis', 'Network')->findAll()