app/Controllers/Printer.php

SELECT *
FROM `assets`
WHERE `jenis` LIKE '%Printer%' ESCAPE '!'
---
    public function index()
    {
        $data = [
            'printers' => $this->assetsModel->like('jenis', 'Printer')->findAll(),
            'title' => 'Printer',
        ];

SELECT *
FROM `assets`
WHERE `assets`.`id` = '40'
---
    public function detail($id)
    {
        $data = [
            'printer' => $this->assetsModel->find($id),
            'title' => 'Detail Printer',
        ];