app/Controllers/Stock.php

    public function tinta()
    {
        $data = [
            'title' => 'Tinta',
            'tintas' => $this->stocksModel->findAll(),
---
SELECT *
FROM `stock`